АлогистикТест2/src/Documents/алк_РапортОкорка/алк_РапортОкорка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_РапортОкорка</name>
  <registerRecords>AccumulationRegister.алк_УчетВремениПропарки</registerRecords>
  <registerRecords>InformationRegister.алк_СтатусПропарки</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиВКамерахПропарки</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Бригада</name>
    <type>
      <types>CatalogRef.алк_СменыШпон</types>
    </type>
  </attributes>
  <attributes>
    <name>Мастер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>ЛинияОкорки</name>
      <type>
        <types>EnumRef.алк_ЛинияОкоркки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Enums/алк_ВидыДокументовПеремещенияЛесопродукции/алк_ВидыДокументовПеремещенияЛесопродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ВидыДокументовПеремещенияЛесопродукции</name>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВУтилизацию</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаСобственныеНужды</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаПереупаковкуСГП</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаЦПШ</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаСГП</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаЦЛП</name>
  </enumValues>
  <enumValues>
    <name>СписаниеНаЦЛП</name>
  </enumValues>
  <enumValues>
    <name>РеализацияНаСторону</name>
  </enumValues>
  <enumValues>
    <name>РеализацияНаДГ</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаС_ЦПШ</name>
  </enumValues>
  <enumValues>
    <name>ВозратС_ЦПШ</name>
  </enumValues>
  <enumValues>
    <name>ВозратС_ЦЛП</name>
  </enumValues>
  <enumValues>
    <name>ВозратС_МЛП</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Enums/алк_ЛинияОкоркки/алк_ЛинияОкоркки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ЛинияОкоркки</name>
  <enumValues>
    <name>ЛинияОкорки1</name>
  </enumValues>
  <enumValues>
    <name>ЛинияОкорки2</name>
  </enumValues>
  <enumValues>
    <name>Металлодетектор</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Documents/алк_ПеремещениеЛесопродукции/алк_ПеремещениеЛесопродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ПеремещениеЛесопродукции</name>
  <comment>Перемещение лесопродукции (круглые ЛМ и пиломатериала штучно) по различным направлениям с указанием участка отправителя</comment>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизации</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОборотыПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <registerRecords>AccumulationRegister.алк_ДокументыПоследовательностиБиржа</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЛесопродукции</registerRecords>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>EnumRef.алк_ВидыДокументовПеремещенияЛесопродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПропускатьМинус</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаПолучатель</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучатель</name>
    <type>
      <types>CatalogRef.Ячейки</types>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Documents/алк_РапортОкорка/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Объект.Организация 			= Справочники.Организации.НайтиПоКоду("00-000001");
		//Объект.СтруктурнаяЕдиница 	= Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000034"); // Участок ГТО
		
		Объект.Мастер = Пользователи.ТекущийПользователь(); 
		                                
		Объект.ДатаСмены = ТекущаяДата(); 
				
	КонецЕсли; 
	
	УчастокПриИзмененииНаСервере();
	
КонецПроцедуры


&НаКлиенте
Процедура ЗапасыПриИзменении(Элемент)
	
	ИзменяемаяСтрока = Элемент.ТекущиеДанные;
	
	//когда удаляют строку
	Если ИзменяемаяСтрока = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	//\\
	
	Если Не ЗначениеЗаполнено(ИзменяемаяСтрока.Номенклатура) Тогда    		
		ИзменяемаяСтрока.Номенклатура = ПолучитьНоменклатуру();
	КонецЕсли; 
	
КонецПроцедуры   

&НаСервереБезКонтекста
Функция ПолучитьНоменклатуру()
	
	Возврат Справочники.Номенклатура.НайтиПоКоду("ПБ-00000002");
	
КонецФункции //ПолучитьНоменклатуру()


&НаКлиенте
Процедура ЗапасыКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	РфпРаботаСДокументами.ПересчитатьОбъемСтроки(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаСервере
Процедура УчастокПриИзмененииНаСервере()
	Элементы.Смена.ПараметрыВыбора = РфпСервер.ПолучитьОтборПоТипуСмены(Объект.Участок, Объект.ДатаСмены);
КонецПроцедуры

&НаКлиенте
Процедура УчастокПриИзменении(Элемент)
	УчастокПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Функция ПодобратьДокументПеремещения()
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПеремещениеЛесопродукции.Ссылка
		|ИЗ
		|	Документ.алк_ПеремещениеЛесопродукции КАК алк_ПеремещениеЛесопродукции
		|ГДЕ
		|	алк_ПеремещениеЛесопродукции.Проведен
		|	И алк_ПеремещениеЛесопродукции.ДатаСмены = &ДатаСмены
		|	И алк_ПеремещениеЛесопродукции.Смена = &Смена
		|	И алк_ПеремещениеЛесопродукции.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДокументовПеремещенияЛесопродукции.ПередачаНаЦПШ)";
	
	Запрос.УстановитьПараметр("ДатаСмены", 	Объект.ДатаСмены);
	Запрос.УстановитьПараметр("Смена", 		Объект.Смена);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат "";
		
	Иначе 
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий();
	
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	
	КонецЕсли; 
	

КонецФункции // ПодобратьДокументПеремещения()
 

&НаСервере
Процедура ЗаполнитьНаСервере()  
		
	Объект.Запасы.Загрузить(ДокументПеремещения.Запасы.Выгрузить());  
	
	
	Если Объект.Участок.Код = "000000005" Тогда   //ЛИНИЯ ОКОРКИ №1 		
		ЛинияОкорки = Перечисления.алк_ЛинияОкоркки.ЛинияОкорки1;		
	ИначеЕсли Объект.Участок.Код = "000000006" Тогда   //ЛИНИЯ ОКОРКИ №2 	
		ЛинияОкорки = Перечисления.алк_ЛинияОкоркки.ЛинияОкорки2;   
	Иначе                                                           	
		ЛинияОкорки = Перечисления.алк_ЛинияОкоркки.Металлодетектор;
	КонецЕсли;
	
	
	Для каждого Стр Из Объект.Запасы Цикл		
		Стр.ЛинияОкорки = ЛинияОкорки;		
	КонецЦикла;  	
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)   
	
	Если Не ЗначениеЗаполнено(ДокументПеремещения) Тогда 
		
		Если Не ЗначениеЗаполнено(Объект.Смена) Тогда  			
			Сообщить("Укажите смену!");			
			Возврат;  	
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.ДатаСмены) Тогда  			
			Сообщить("Укажите дату смены!");		
			Возврат; 	
		КонецЕсли; 
		
		ДокументПеремещения = ПодобратьДокументПеремещения();	
		
		Если Не ЗначениеЗаполнено(ДокументПеремещения) Тогда 
			
			Сообщить("Документ перемещения не найден!");		
			Возврат;
			
		КонецЕсли;
	
	КонецЕсли;
	
	ЗаполнитьНаСервере();
	
КонецПроцедуры
